In [2]:
import pandas as pd


salarydf = pd.read_csv('salaries.csv', delimiter=',')
salarydf.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [5]:
''' 
        We are now creating the Decision Tree Classification for predicting the salary is more than 100k for based on job and company,degree
'''

''' 
  convert the categorical to numerical representation
'''

from sklearn.preprocessing import LabelEncoder

companyEncoder = LabelEncoder()
jobEncoder = LabelEncoder()
degreeEncoder = LabelEncoder()


salarydf['company'] = companyEncoder.fit_transform(salarydf['company'])
salarydf['job'] = jobEncoder.fit_transform(salarydf['job'])
salarydf['degree'] = degreeEncoder.fit_transform(salarydf['degree'])

x = salarydf.drop('salary_more_then_100k', axis=1)
y = salarydf['salary_more_then_100k']

In [6]:
x

    company  job  degree
0         2    2       0
1         2    2       1
2         2    0       0
3         2    0       1
4         2    1       0
5         2    1       1
6         0    2       1
7         0    1       0
8         0    0       0
9         0    0       1
10        1    2       0
11        1    2       1
12        1    0       0
13        1    0       1
14        1    1       0
15        1    1       1

In [7]:
from sklearn.tree import DecisionTreeClassifier

Tree = DecisionTreeClassifier()
Tree.fit(x,y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [10]:
exdf = pd.concat([x,y], axis=1)
exdf.head(10)

   company  job  degree  salary_more_then_100k
0        2    2       0                      0
1        2    2       1                      0
2        2    0       0                      1
3        2    0       1                      1
4        2    1       0                      0
5        2    1       1                      1
6        0    2       1                      0
7        0    1       0                      0
8        0    0       0                      0
9        0    0       1                      1

In [12]:
Tree.predict([[0,0,1]])

array([1])

In [13]:
Tree.score(x,y)

1.0

In [20]:
def predictAnalyzer(prediction):
  if prediction:
    print("Yes Salary is Above 100K")
  else:
    print("No Salary is Above 100K")

In [19]:
# Is a Google,Computer Engineer,Master Degree > 100k?

result = Tree.predict([[2,1,1]]) #take 5 row data in above exdf 
predictAnalyzer(result)

Yes Salary is Above 100K